TexasInstruments/c2000ware-core-sdk/driverlib/f280015x/driverlib/inc/hw_sysctl.h
//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_CLR register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_INT_CLR_GINT              0x1U       // Global Interrupt flag Clear bit
#define SYSCTL_SYS_ERR_INT_CLR_CORRECTABLE_ERR   0x4U       // CORRECTABLE_ERR interrupt flag clear
                                                            // bit
#define SYSCTL_SYS_ERR_INT_CLR_RAM_ACC_VIOL      0x10U      // RAM_ACC_VIOL interrupt flag clear
                                                            // bit
#define SYSCTL_SYS_ERR_INT_CLR_EPG1_INT          0x800U     // EPG1_INT interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_FPU_UFLOW         0x10000U   // FPU_UFLOW interrupt flag clear bit
#define SYSCTL_SYS_ERR_INT_CLR_FPU_OFLOW         0x20000U   // FPU_OFLOW interrupt flag clear bit

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_INT_SET register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_INT_SET_CORRECTABLE_ERR   0x4U          // CORRECTABLE_ERR interrupt flag
                                                               // set bit
#define SYSCTL_SYS_ERR_INT_SET_RAM_ACC_VIOL      0x10U         // RAM_ACC_VIOL interrupt flag set
                                                               // bit
#define SYSCTL_SYS_ERR_INT_SET_EPG1_INT          0x800U        // EPG1_INT interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_FPU_UFLOW         0x10000U      // FPU_UFLOW interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_FPU_OFLOW         0x20000U      // FPU_OFLOW interrupt flag set bit
#define SYSCTL_SYS_ERR_INT_SET_KEY_S             24U
#define SYSCTL_SYS_ERR_INT_SET_KEY_M             0xFF000000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the SYS_ERR_MASK register
//
//*************************************************************************************************
#define SYSCTL_SYS_ERR_MASK_CORRECTABLE_ERR   0x4U          // CORRECTABLE_ERR flag mask bit
#define SYSCTL_SYS_ERR_MASK_RAM_ACC_VIOL      0x10U         // RAM_ACC_VIOL flag mask bit
#define SYSCTL_SYS_ERR_MASK_EPG1_INT          0x800U        // EPG1_INT flag mask bit
#define SYSCTL_SYS_ERR_MASK_FPU_UFLOW         0x10000U      // FPU_UFLOW flag mask bit
#define SYSCTL_SYS_ERR_MASK_FPU_OFLOW         0x20000U      // FPU_OFLOW flag mask bit
#define SYSCTL_SYS_ERR_MASK_KEY_S             24U
#define SYSCTL_SYS_ERR_MASK_KEY_M             0xFF000000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the LCM_ERR_FLG register
//
//*************************************************************************************************
#define SYSCTL_LCM_ERR_FLG_GERR   0x1U   // Global Error event flag
#define SYSCTL_LCM_ERR_FLG_CPU    0x2U   // CPU1 Lockstep Miscompare flag

//*************************************************************************************************
//
// The following are defines for the bit fields in the LCM_ERR_FLG_CLR register
//
//*************************************************************************************************
#define SYSCTL_LCM_ERR_FLG_CLR_GERR   0x1U   // Global Error event flag clear
#define SYSCTL_LCM_ERR_FLG_CLR_CPU    0x2U   // CPU1 Lockstep Miscompare flag clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the LCM_ERR_FLG_SET register
//
//*************************************************************************************************
#define SYSCTL_LCM_ERR_FLG_SET_CPU     0x2U          // CPU1 Lockstep Miscompare flag clear set
#define SYSCTL_LCM_ERR_FLG_SET_KEY_S   24U
#define SYSCTL_LCM_ERR_FLG_SET_KEY_M   0xFF000000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the REGPARITY_ERR_FLG register
//
//*************************************************************************************************
#define SYSCTL_REGPARITY_ERR_FLG_GERR   0x1U   // Global Error event flag
#define SYSCTL_REGPARITY_ERR_FLG_CPU    0x2U   // Register parity error from lockstep compare
                                               // module

//*************************************************************************************************
//
// The following are defines for the bit fields in the REGPARITY_ERR_FLG_CLR register
//
//*************************************************************************************************
#define SYSCTL_REGPARITY_ERR_FLG_CLR_GERR   0x1U   // Global Error event flag clear
#define SYSCTL_REGPARITY_ERR_FLG_CLR_CPU    0x2U   // Register parity error from lockstep compare
                                                   // module clear

//*************************************************************************************************
//
// The following are defines for the bit fields in the REGPARITY_ERR_FLG_SET register
//
//*************************************************************************************************
#define SYSCTL_REGPARITY_ERR_FLG_SET_CPU     0x2U          // Register parity error from lockstep
                                                           // compare module set
#define SYSCTL_REGPARITY_ERR_FLG_SET_KEY_S   24U
#define SYSCTL_REGPARITY_ERR_FLG_SET_KEY_M   0xFF000000U   // KEY field

//*************************************************************************************************
//
// The following are defines for the bit fields in the REGPARITY_ERR_FLG_MASK register
//
//*************************************************************************************************
#define SYSCTL_REGPARITY_ERR_FLG_MASK_CPU     0x2U          // Register parity error from lockstep
                                                            // compare module mask
#define SYSCTL_REGPARITY_ERR_FLG_MASK_KEY_S   24U
#define SYSCTL_REGPARITY_ERR_FLG_MASK_KEY_M   0xFF000000U   // KEY field



#endif
